{"b3cde2f4286ee8fca00066814cd36fa677f6ce2624db87a9b94c7ec8857854f4": ["Can you walk me through a project where you had to quickly learn a new skill or technology?"], "4ff995d9b7457c69bcc5d5c6c5c04880077c81588dea8914f4b3bc0a7847caad": ["Can you walk us through your educational background and highlight any relevant coursework or projects?", "What motivated you to pursue opportunities in [field/industry related to role] given your current experience level?", "Describe a time you worked collaboratively in a team setting – what was your role and contribution?", "How do you approach learning new technical skills or tools when starting a project?", "What personal projects or self-directed learning have you undertaken to develop skills for this role?", "How would you handle a situation where you encountered a technical challenge beyond your current knowledge?", "What soft skills (communication, time management, etc.) do you consider strongest, and how have you demonstrated them?", "Where do you see your career progressing in the next 3-5 years, and how does this role align with that vision?", "Describe a situation where you had to adapt quickly to changing priorities or requirements?", "Why are you specifically interested in this company/position compared to other entry-level opportunities?"], "de2750270aee61190ea355a902aa999c57dc89bfa5a305c198aa0f42a3a32604": ["Can you describe your experience with Python and Flask in developing backend systems?", "How have you optimized backend applications to handle high traffic or scalability demands?", "What approach do you take when designing and implementing complex SQL queries for performance-critical applications?", "Can you share an example of a challenging backend system architecture you designed and the trade-offs involved?", "How do you ensure the reliability and maintainability of backend services over long-term projects?", "Describe a time you debugged a critical production issue in a Python-based backend system. What was your process?", "What strategies do you use to secure backend APIs and protect against vulnerabilities like SQL injection?", "How have you mentored junior developers or contributed to technical decision-making in your previous roles?", "How do you stay updated with evolving backend technologies, and how have you applied new tools/techniques recently?", "Can you discuss a project where you had to balance technical debt with feature delivery deadlines?"], "d3629bd118ce5e92a1fa2cfe16783c15323eacbd38023d205fed23d606fc228f": ["Can you walk me through your experience with PDF document processing and extraction?", "Which programming languages and libraries have you used for handling PDF files?", "How would you approach extracting structured data from a complex PDF that contains mixed text and images?", "What challenges have you faced when working with PDF metadata and how did you resolve them?", "Can you describe a project where you had to automate PDF generation or conversion?", "How do you ensure the accessibility and compliance of PDFs you work on?", "What steps do you take to handle large PDFs efficiently in terms of memory and performance?", "Have you"]}